Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes
The ReinforcementMeshAttributes class is the base attributes class for ReinforcementMesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.MeshReinforcementVisibilityLongitudinal
Defines which longitudinal wires in the mesh appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.MeshReinforcementVisibilityCrossing
Defines which crossing bars in the mesh appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.MeshReinforcementSymbolIndex
Defines the index for the mesh symbol to be used.
The mesh symbol appears in the middle of the mesh line when ReinforcementRepresentation == OutLine.
The index starts from 0 and corresponds to the symbol in the file mesh.sym.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.MeshReinforcementSymbolSize
Defines the size of the reinforcement mesh symbol.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.#ctor
Creates a new default reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.#ctor(System.Boolean)
Creates a new default reinforcement attributes instance that loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.#ctor(System.String)
Creates a new reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.